infor/ab_test_02.txt
ab -k -n 1000 -c 50 -t 20 http://ckan.sistematiza.cl/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ckan.sistematiza.cl (be patient)
Finished 89 requests


Server Software:        nginx/1.10.3
Server Hostname:        ckan.sistematiza.cl
Server Port:            80

Document Path:          /
Document Length:        13954 bytes

Concurrency Level:      50
Time taken for tests:   20.150 seconds
Complete requests:      89
Failed requests:        0
Keep-Alive requests:    89
Total transferred:      1269585 bytes
HTML transferred:       1241906 bytes
Requests per second:    4.42 [#/sec] (mean)
Time per request:       11320.003 [ms] (mean)
Time per request:       226.400 [ms] (mean, across all concurrent requests)
Transfer rate:          61.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   87  78.0    142     177
Processing:   502 7726 3411.8   9642   10885
Waiting:      342 7561 3400.7   9471   10720
Total:        643 7813 3365.5   9814   10898

Percentage of the requests served within a certain time (ms)
  50%   9661
  66%  10529
  75%  10566
  80%  10639
  90%  10728
  95%  10791
  98%  10885
  99%  10898
 100%  10898 (longest request)